var data = [
    {
      "行政區": "中區",
      "名稱": "中華路觀光夜市攤販集中區",
      "位址": "中華路一、二段、、公園路、大誠街",
      "攤販數": "549",
      "營業頻率": "每周 7天 (星期一至日)",
      "早": null,
      "午": null,
      "晚": "V",
      "備註": "本市列管"
    },
    {
      "行政區": "西屯區",
      "名稱": "逢甲觀光夜市攤販集中區",
      "位址": "文華路南段（逢甲大學側門至福星路）",
      "攤販數": "184",
      "營業頻率": "每周 7天 (星期一至日)",
      "早": null,
      "午": null,
      "晚": "V",
      "備註": "本市列管"
    },
    {
      "行政區": "北屯區",
      "名稱": "昌平夜市攤販集中區",
      "位址": "昌平路一段、北平路四段",
      "攤販數": "60",
      "營業頻率": "每周 7天 (星期一至日)",
      "早": null,
      "午": null,
      "晚": "V",
      "備註": "本市列管"
    },
    {
      "行政區": "西屯區",
      "名稱": "環中夜市攤販集中區",
      "位址": "環中路三段780-3號",
      "攤販數": "163",
      "營業頻率": "每周 3天 (星期五至日)",
      "早": null,
      "午": null,
      "晚": "V",
      "備註": "公保地(道路用地)"
    },
    {
      "行政區": "東區",
      "名稱": "旱溪夜市攤販集中區",
      "位址": "旱溪東路一段與振興路口",
      "攤販數": "220",
      "營業頻率": "每周 4天 (每星期二、四、五、六)",
      "早": null,
      "午": null,
      "晚": "V",
      "備註": "公保地(學校用地)"
    }
  ];
var list = document.querySelector('.list');
var datalen = data.length;
console.log(datalen);

function updatelist(e){
    var select = e.target.value;
    console.log(select);

    var str1 = '';
    for (var i=0 ;i<datalen;i++){
        if(select == data[i].行政區){
            str1 += 
            '<p>'+'夜市名稱:'+data[i].名稱+'</p>'+
            '<p>'+'地址:' +data[i].位址+'</p>'+
            '<p>'+'營業日期:' +data[i].營業頻率+'</p>'+
            '<p>'+'攤販數量:' +data[i].攤販數+'攤'+'</p>'+
            '<hr>';
        }
    }
    list.innerHTML = str1;
}


nselect.addEventListener('change',updatelist,false);